In [2]:
import pandas as pd   
import numpy as np
from pandas import Series
from pandas import DataFrame as df

In [6]:
dict = {
    'Year' : [2015,2016,2017,2018,2019],
    'Population' : [30,32.2,34.5,35,36.3],
    'GDP' : [110,114,113,112,110]
}
df1 = pd.DataFrame(dict)
df1

   Year  Population  GDP
0  2015        30.0  110
1  2016        32.2  114
2  2017        34.5  113
3  2018        35.0  112
4  2019        36.3  110

In [7]:
df1.head(3) # head

   Year  Population  GDP
0  2015        30.0  110
1  2016        32.2  114
2  2017        34.5  113

In [8]:
df1.shape

(5, 3)

In [11]:
df1 = df(dict,columns=['Year', 'GDP', 'GDP per capita', 'Population'], index=[1,2,3,4,5])
df1

   Year  GDP GDP per capita  Population
1  2015  110            NaN        30.0
2  2016  114            NaN        32.2
3  2017  113            NaN        34.5
4  2018  112            NaN        35.0
5  2019  110            NaN        36.3

In [15]:
df1['GDP per capita'] = [1.5,1.8,1.9,2.5,3.3]
df1

   Year  GDP  GDP per capita  Population
1  2015  110             1.5        30.0
2  2016  114             1.8        32.2
3  2017  113             1.9        34.5
4  2018  112             2.5        35.0
5  2019  110             3.3        36.3

In [36]:
df1['111+'] = df1.GDP > 111
df1

   Year  GDP  GDP per capita  Population   100+   111+
1  2015  110             1.5        30.0  False  False
2  2016  114             1.8        32.2   True   True
3  2017  113             1.9        34.5   True   True
4  2018  112             2.5        35.0   True   True
5  2019  110             3.3        36.3  False  False

In [37]:
del df1['111+']
del df1['100+']
df1

   Year  GDP  GDP per capita  Population
1  2015  110             1.5        30.0
2  2016  114             1.8        32.2
3  2017  113             1.9        34.5
4  2018  112             2.5        35.0
5  2019  110             3.3        36.3

In [40]:
val = pd.Series([1750, 1560, 1270], index=[5, 3, 1])
df1['YAIM'] = val
df1

   Year  GDP  GDP per capita  Population    YAIM
1  2015  110             1.5        30.0  1270.0
2  2016  114             1.8        32.2     NaN
3  2017  113             1.9        34.5  1560.0
4  2018  112             2.5        35.0     NaN
5  2019  110             3.3        36.3  1750.0

In [45]:
YAIM = [1700, 1670, 1600, 1590, 1400]
df1['YAIM'] = YAIM
df1

   Year  GDP  GDP per capita  Population  YAIM
1  2015  110             1.5        30.0  1700
2  2016  114             1.8        32.2  1670
3  2017  113             1.9        34.5  1600
4  2018  112             2.5        35.0  1590
5  2019  110             3.3        36.3  1400

In [46]:
data = {
    'Uzbekistan':{2021:33.9, 2020:33.5, 2019:32.9, 2018:32.5, 2017:31.9},
    'Kazakhstan':{2021:18.9, 2020:18.7, 2019:18.5, 2018:18.3, 2017:18.1, 2016:17.8}
}
df2 = df(data)
df2

      Uzbekistan  Kazakhstan
2016         NaN        17.8
2017        31.9        18.1
2018        32.5        18.3
2019        32.9        18.5
2020        33.5        18.7
2021        33.9        18.9

In [48]:
df2.T

            2016  2017  2018  2019  2020  2021
Uzbekistan   NaN  31.9  32.5  32.9  33.5  33.9
Kazakhstan  17.8  18.1  18.3  18.5  18.7  18.9

In [54]:
df2.index.name = 'Yil'
df2 = df2.T
df2

Yil         2016  2017  2018  2019  2020  2021
Uzbekistan   NaN  31.9  32.5  32.9  33.5  33.9
Kazakhstan  17.8  18.1  18.3  18.5  18.7  18.9

In [60]:
arr = df2.values
arr

array([[ nan, 31.9, 32.5, 32.9, 33.5, 33.9],
       [17.8, 18.1, 18.3, 18.5, 18.7, 18.9]])

In [62]:
arr[0,0] = 0
arr

array([[ 0. , 31.9, 32.5, 32.9, 33.5, 33.9],
       [17.8, 18.1, 18.3, 18.5, 18.7, 18.9]])